#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ad9328cc-f535-4f7f-869f-207443949070]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a2bcf65c-da6e-4f30-b363-a912f862f75b]
module.keycloak_test.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=10ed7f71-67d2-45cf-b179-5933d2c53d80]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d7ad910e-c22c-4eed-8efc-39d6d6f9edfa]
module.keycloak_test.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=df8a8597-2661-46c5-8595-9369aa74c9de]
module.keycloak_test.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ab44ffd7-f1dd-4ab3-8675-3d976a7854c8]
module.keycloak_test.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=02095d74-4b80-44b3-8e4c-e79c5185999a]
module.keycloak_test.module.onestopauth.module.client_test-1-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d5b84701-21e3-47ee-8d1e-a79e5d82508b]
module.keycloak_test.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a6c96df3-f033-4d6d-a783-56c6dd4c9798]
module.keycloak_test.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=97a3a4ff-e3e6-4214-8974-ba57beb2c6b3]
module.keycloak_test.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3414e5fb-1170-498b-9bfd-0666d1058923]
module.keycloak_test.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=6b1928c5-63d9-42dd-ab56-ead99e67d95e]
module.keycloak_test.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=aaa7022d-53eb-4b73-9ae1-0796bdd70690]
module.keycloak_test.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b0179020-af50-4192-9ab8-934a09d3be5d]
module.keycloak_test.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c9011677-b44f-49ca-98e1-8e093580aa12]
module.keycloak_test.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=aa006c19-8d7c-4639-b718-d06742b9ca79]
module.keycloak_test.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=6ca045a6-8202-4d1f-8302-00cc5cc62d16]
module.keycloak_test.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=05c5c7f0-f458-4e58-8014-0f4acf011ab3]
module.keycloak_test.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a92ccf87-6cb1-4a8c-af55-f2f4b06e93b3]
module.keycloak_test.module.onestopauth.module.client_test-6-08-10-2021-471.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=11d2d86e-8fb4-4ebf-979d-d8aa0f3cc223]
module.keycloak_test.module.onestopauth.module.client_test-6-08-10-2021-471.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3bc157b4-fe70-4a1f-953d-198c3ec60e10]
module.keycloak_test.module.onestopauth.module.client_test-6-08-10-2021-471.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=bbbd7544-ecd0-4741-9bd6-55a9682f3301]
module.keycloak_test.module.onestopauth.module.client_test-6-08-10-2021-471.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ae05777c-b6c1-4a77-9577-c75d132d72d5]
module.keycloak_test.module.onestopauth.module.client_test-6-08-10-2021-471.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=08cc3bef-7a0c-45d4-95a0-02c3de1726af]
module.keycloak_test.module.onestopauth.module.client_test-6-08-10-2021-471.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e1a776cc-65b7-4f58-b3de-9c00d3ef89c5]
module.keycloak_test.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1ac4e892-f235-4a73-b135-0a405cc9a068]
module.keycloak_test.module.onestopauth.module.client_3-test-for-v-1-238.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6bf8b0a6-d38e-4f67-b9c3-6aef0f612503]
module.keycloak_test.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=1f396a8b-8f1c-4876-90dd-d58a3e66b6a1]
module.keycloak_test.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=26e0234d-a7d6-4e93-94b8-94d364f41cf8]
module.keycloak_test.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=bb0171f7-2b68-49d5-8e97-51ae209f40bf]
module.keycloak_test.module.onestopauth.module.client_3-test-for-v-1-238.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=841cd912-503a-4ec1-997c-5e2f14976fbd]
module.keycloak_test.module.onestopauth.module.client_3-test-for-v-1-238.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e13148a3-73d0-4664-b7d6-5da642ea66d4]
module.keycloak_test.module.onestopauth.module.client_3-test-for-v-1-238.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=09d0f991-1b59-452c-80fe-c34bf888feac]
module.keycloak_test.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=9eaf45d8-2407-4fdc-a2a4-8870e0510b34]
module.keycloak_test.module.onestopauth.module.client_3-test-for-v-1-238.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=e436eaf6-2d97-416e-9822-e74ef85bbee1]
module.keycloak_test.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=64bcfa78-ab2f-4516-a330-dd3098274569]
module.keycloak_test.module.onestopauth.module.client_3-test-for-v-1-238.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cbf9108a-9276-4c34-8f86-030141ae00d7]
module.keycloak_test.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a228895b-fecd-4965-ab59-5d0210b8e21c]
module.keycloak_test.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d92e424f-2752-46fa-b28c-1f3ca1eb2398]
module.keycloak_test.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=a29ea2e1-0a43-47c3-aa59-faa0cac1954d]
module.keycloak_test.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3edcd8c7-9f4d-43df-95cf-e245048b3638]
module.keycloak_test.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ccced5cd-6abc-45e8-9902-e66c279aa074]
module.keycloak_test.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=e6d3095c-8de5-4c6d-96e2-6ec9ad4179dc]
module.keycloak_test.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b81b2668-eb5e-4773-9951-ff68fee91bb5]
module.keycloak_test.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c0062513-8c3e-4727-849c-d6706e2c0622]
module.keycloak_test.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=acc240a8-f531-47dc-b2df-8cbaed435197]
module.keycloak_test.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=79d2ec41-fe58-48fc-8134-37b79a153950]
module.keycloak_test.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=91270246-2b85-4f0e-a675-034f90876e7f]
module.keycloak_test.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=7ece4bd5-954c-4484-b00f-91687f159e23]
module.keycloak_test.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=73e3f359-8709-4fe1-9a57-cbb46105f8a2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1717.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1717.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1717.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1717.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "cypress-test-1717"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1717.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1717.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1717.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "cypress-test-1717"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "cypress-test-1717"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://cypress",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1717.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1717.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1717.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1717.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "cypress-test-1717"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1717.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1717.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1717.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "cypress-test-1717"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "cypress-test-1717"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://cypress",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1717.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1717.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1717.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1717.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "cypress-test-1717"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1717.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1717.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1717.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "cypress-test-1717"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "cypress-test-1717"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://cypress",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

Plan: 21 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 1988 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*